/*! modal spartak
//@ rasar.ru
*/
$(document).ready(function() { // Р·Р°РїСѓСЃРєР°РµРј СЃРєСЂРёРїС‚ РїРѕСЃР»Рµ Р·Р°РіСЂСѓР·РєРё РІСЃРµС… СЌР»РµРјРµРЅС‚РѕРІ
  /* Р·Р°СЃСѓРЅРµРј СЃСЂР°Р·Сѓ РІСЃРµ СЌР»РµРјРµРЅС‚С‹ РІ РїРµСЂРµРјРµРЅРЅС‹Рµ, С‡С‚РѕР±С‹ СЃРєСЂРёРїС‚Сѓ РЅРµ РїСЂРёС…РѕРґРёР»РѕСЃСЊ РёС… РєР°Р¶РґС‹Р№ СЂР°Р· РёСЃРєР°С‚СЊ РїСЂРё РєР»РёРєР°С… */
  var overlay = $('#overlay'); // РїРѕРґР»РѕР¶РєР°, РґРѕР»Р¶РЅР° Р±С‹С‚СЊ РѕРґРЅР° РЅР° СЃС‚СЂР°РЅРёС†Рµ
  var open_modal = $('.open_modal'); // РІСЃРµ СЃСЃС‹Р»РєРё, РєРѕС‚РѕСЂС‹Рµ Р±СѓРґСѓС‚ РѕС‚РєСЂС‹РІР°С‚СЊ РѕРєРЅР°
  var close = $('.modal_close, #overlay'); // РІСЃРµ, С‡С‚Рѕ Р·Р°РєСЂС‹РІР°РµС‚ РјРѕРґР°Р»СЊРЅРѕРµ РѕРєРЅРѕ, С‚.Рµ. РєСЂРµСЃС‚РёРє Рё РѕРІРµСЂР»СЌР№-РїРѕРґР»РѕР¶РєР°
  var modal = $('.modal_div'); // РІСЃРµ СЃРєСЂС‹С‚С‹Рµ РјРѕРґР°Р»СЊРЅС‹Рµ РѕРєРЅР°

   open_modal.click( function(event){ // Р»РѕРІРёРј РєР»РёРє РїРѕ СЃСЃС‹Р»РєРµ СЃ РєР»Р°СЃСЃРѕРј open_modal
       event.preventDefault(); // РІС‹СЂСѓР±Р°РµРј СЃС‚Р°РЅРґР°СЂС‚РЅРѕРµ РїРѕРІРµРґРµРЅРёРµ
       var div = $(this).attr('href'); // РІРѕР·СЊРјРµРј СЃС‚СЂРѕРєСѓ СЃ СЃРµР»РµРєС‚РѕСЂРѕРј Сѓ РєР»РёРєРЅСѓС‚РѕР№ СЃСЃС‹Р»РєРё
       overlay.fadeIn(400, //РїРѕРєР°Р·С‹РІР°РµРј РѕРІРµСЂР»СЌР№
           function(){ // РїРѕСЃР»Рµ РѕРєРѕРЅС‡Р°РЅРёСЏ РїРѕРєР°Р·С‹РІР°РЅРёСЏ РѕРІРµСЂР»СЌСЏ
               $(div) // Р±РµСЂРµРј СЃС‚СЂРѕРєСѓ СЃ СЃРµР»РµРєС‚РѕСЂРѕРј Рё РґРµР»Р°РµРј РёР· РЅРµРµ jquery РѕР±СЉРµРєС‚
                   .css('display', 'block') 
                   .animate({opacity: 1, top: '50%'}, 200); // РїР»Р°РІРЅРѕ РїРѕРєР°Р·С‹РІР°РµРј
       });
   });

   close.click( function(){ // Р»РѕРІРёРј РєР»РёРє РїРѕ РєСЂРµСЃС‚РёРєСѓ РёР»Рё РѕРІРµСЂР»СЌСЋ
          modal // РІСЃРµ РјРѕРґР°Р»СЊРЅС‹Рµ РѕРєРЅР°
           .animate({opacity: 0, top: '45%'}, 200, // РїР»Р°РІРЅРѕ РїСЂСЏС‡РµРј
               function(){ // РїРѕСЃР»Рµ СЌС‚РѕРіРѕ
                   $(this).css('display', 'none');
                   overlay.fadeOut(400); // РїСЂСЏС‡РµРј РїРѕРґР»РѕР¶РєСѓ
               }
           );
   });
});